5 Functions of the pandas library

In [1]:
# DataFrame
# Series
# to_csv
# Unique()
# Reading an CSV file

In [2]:
import pandas as pd
# Data Frame

data = {
    'Name': ['Alice','Bob','Claire'],
    'Age' : [25,30,27],
    'Gender' : ['Female','Male','Female']
}

df = pd.DataFrame(data)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [3]:
df.to_csv('test.csv',index= False)

In [4]:
# Series
var = ['First_value','Second_value','Third_value','Forth_value','Fifth_value','Sixth_value','Seventh_value','Eightth_value','Ninth_Value','Tenth_value']

sr = pd.Series(var)
print(sr)

0      First_value
1     Second_value
2      Third_value
3      Forth_value
4      Fifth_value
5      Sixth_value
6    Seventh_value
7    Eightth_value
8      Ninth_Value
9      Tenth_value
dtype: object

In [5]:

df2 = pd.read_csv('test.csv')
df2

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [6]:
df2.isna()

    Name    Age  Gender
0  False  False   False
1  False  False   False
2  False  False   False

In [7]:
pd.unique(df2['Name'])

array(['Alice', 'Bob', 'Claire'], dtype=object)

In [ ]:
# Q2

In [161]:
data = {
    'Name': ['Alice','Bob','Claire','varun'],
    'Values' : [25,30,27,34],
    'Gender' : ['Female','Male','Female','Male']
}

df1 = pd.DataFrame(data)
df1

     Name  Values  Gender
0   Alice      25  Female
1     Bob      30    Male
2  Claire      27  Female
3   varun      34    Male

In [176]:
ind = ['0','2','4','6']

df1['New_index'] = ind

df1.set_index('New_index')

             Name  Values  Gender
New_index
0           Alice      25  Female
2             Bob      30    Male
4          Claire      27  Female
6           varun      34    Male

2. Create a Function

In [8]:
def value_sum(df):
    return sum(df.Values[:3])

In [9]:
data = {
    'Name': ['Alice','Bob','Claire','varun'],
    'Values' : [25,30,27,34],
    'Gender' : ['Female','Male','Female','Male']
}

df1 = pd.DataFrame(data)
df1

     Name  Values  Gender
0   Alice      25  Female
1     Bob      30    Male
2  Claire      27  Female
3   varun      34    Male

In [10]:
value_sum(df1)

82

In [11]:
text = ['Hellow I am Varun','I want to be data Scientist','I am preprairing for it by PWSkills','Here Python is tought by Sudhanshu sir']

In [12]:
df1['text'] = text

In [13]:
def word_ct(df):
    word_count = []
    for i in df.text:
        word_count.append(len(i.split(' ')))
    df['word_count'] = word_count
    return df

In [14]:
word_ct(df1)

     Name  Values  Gender                                    text  word_count
0   Alice      25  Female                       Hellow I am Varun           4
1     Bob      30    Male             I want to be data Scientist           6
2  Claire      27  Female     I am preprairing for it by PWSkills           7
3   varun      34    Male  Here Python is tought by Sudhanshu sir           7

In [15]:
df1.size # tells the total value count

20

In [16]:
df1.shape  # give the dimention of the data if we multiply both then we get total size of my data

(4, 5)

In [177]:
#For reading the Excel file we use pd.read_excel

In [18]:
email = ['alice@gmail.com','bob@gmail.com','calire@gmail.com','varun@gmail.com']

df1['email'] = email

In [19]:
def user_filter(df):
    mailid = []
    
    for i in df.email:
        mailid.append(i.split('@')[0])
        
    df['User_name'] = mailid
    return df

In [20]:
user_filter(df1)

,Name,Values,Gender,text,word_count,email,User_name
0,Alice,25,Female,Hellow I am Varun,4,alice@gmail.com,alice
1,Bob,30,Male,I want to be data Scientist,6,bob@gmail.com,bob
2,Claire,27,Female,I am preprairing for it by PWSkills,7,calire@gmail.com,calire
3,varun,34,Male,Here Python is tought by Sudhanshu sir,7,varun@gmail.com,varun

In [21]:
data = {
    'A' : [3,8,6,2,9],
    'B' : [5,2,9,3,1],
    'C' : [1,7,4,5,2]
}

df2 = pd.DataFrame(data)
df2

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [22]:
def selected_row(df):
    df1 = df[df['A'] > 5]
    return df1[df1['B'] < 10]

In [23]:
selected_row(df2)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

In [24]:
data = {
    'Name': ['Alice','Bob','Claire','varun','Chanchal'],
    'Values' : [25,30,27,34,24],
    'Gender' : ['Female','Male','Female','Male','Female']
}

df1 = pd.DataFrame(data)
df1

       Name  Values  Gender
0     Alice      25  Female
1       Bob      30    Male
2    Claire      27  Female
3     varun      34    Male
4  Chanchal      24  Female

In [25]:
def value_stat(df):
    var = ['Mean','Median','Standard Deviation']
    st = [df['Values'].mean(),df1['Values'].median(),df1['Values'].std()]
    return var,st

In [26]:
value_stat(df1)

(['Mean', 'Median', 'Standard Deviation'], [28.0, 27.0, 4.06201920231798])

In [ ]:
# Q10

In [73]:
Data = {'Date' : ['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05','2023-01-06','2023-01-07','2023-01-08',
                  '2023-01-09','2023-01-10','2023-01-11','2023-01-12','2023-01-13','2023-01-14','2023-01-15','2023-01-16'],
        'Sales' : [45,85,45,15,25,65,95,65,85,58,56,59,55,65,55,51] 
}

In [120]:
df1 = pd.DataFrame(Data)
df1

          Date  Sales
0   2023-01-01     45
1   2023-01-02     85
2   2023-01-03     45
3   2023-01-04     15
4   2023-01-05     25
5   2023-01-06     65
6   2023-01-07     95
7   2023-01-08     65
8   2023-01-09     85
9   2023-01-10     58
10  2023-01-11     56
11  2023-01-12     59
12  2023-01-13     55
13  2023-01-14     65
14  2023-01-15     55
15  2023-01-16     51

In [152]:
def moving_avg(df):
    date = []
    
    for dt in range(len(df['Sales'])):
        if (dt < 3) | (dt > len(df['Sales'])-4):
            date.append('-')
        else:
            date.append(df['Sales'][dt-3: dt +4].mean())
    df['Moving_avg'] = date
            
    return df

In [153]:
moving_avg(df1)

          Date  Sales Moving_avg
0   2023-01-01     45          -
1   2023-01-02     85          -
2   2023-01-03     45          -
3   2023-01-04     15  53.571429
4   2023-01-05     25  56.428571
5   2023-01-06     65  56.428571
6   2023-01-07     95  58.285714
7   2023-01-08     65  64.142857
8   2023-01-09     85       69.0
9   2023-01-10     58  67.571429
10  2023-01-11     56  63.285714
11  2023-01-12     59  61.857143
12  2023-01-13     55       57.0
13  2023-01-14     65          -
14  2023-01-15     55          -
15  2023-01-16     51          -

In [71]:
import pandas as pd
data = {
    'Name': ['Alice','Bob','Claire','varun','Chanchal'],
    'Values' : [25,30,27,34,24],
    'Gender' : ['Female','Male','Female','Male','Female'],
    'Date' : ['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05']
}

df = pd.DataFrame(data)
df

       Name  Values  Gender        Date
0     Alice      25  Female  2023-01-01
1       Bob      30    Male  2023-01-02
2    Claire      27  Female  2023-01-03
3     varun      34    Male  2023-01-04
4  Chanchal      24  Female  2023-01-05

In [72]:
from datetime import datetime

def cal_weekday(df):
    days = ["Monday", "Tuesday", "Wednesday",
        "Thursday", "Friday", "Saturday", "Sunday"]
    weekday = []
    
    for i in df['Date']:
        weekday.append(days[datetime(int(i.split('-')[0]),int(i.split('-')[1]),int(i.split('-')[2])).weekday()])
    df['Weekday'] = weekday
    return df

In [29]:
cal_weekday(df)

       Name  Values  Gender        Date    Weekday
0     Alice      25  Female  2023-01-01     Sunday
1       Bob      30    Male  2023-01-02     Monday
2    Claire      27  Female  2023-01-03    Tuesday
3     varun      34    Male  2023-01-04  Wednesday
4  Chanchal      24  Female  2023-01-05   Thursday

In [33]:
# Q 12
Date = ['2023-01-01','2023-01-02','2021-02-05','2016-01-03']

In [39]:
from datetime import date

def date_convertor(lst):
    ls = []
    for i in lst:
        ls.append(date(int(i.split('-')[0]),int(i.split('-')[1]),int(i.split('-')[2])))
    return ls

In [67]:
Date = date_convertor(Date)

In [69]:
range_date = []

for i in Date:
    if (i > date(2023,1,1)) & (i < date(2023,1,31)) :
        range_date.append(i)

In [70]:
range_date

[datetime.date(2023, 1, 2)]

In [ ]:
# Numpy is the most imported library to use Pandas basic functionallity